Rejdok/STM32-Marlin-Port/Marlin/Portable/stm32_stepper.cpp
//todo timer
#define ENABLE_STEPPER_DRIVER_INTERRUPT()  HAL_TIM_Base_Start_IT(&TimerStepper)
#define DISABLE_STEPPER_DRIVER_INTERRUPT() HAL_TIM_Base_Stop_IT(&TimerStepper)

/**
 *         __________________________
 *        /|                        |\     _________________         ^
 *       / |                        | \   /|               |\        |
 *      /  |                        |  \ / |               | \       s
 *     /   |                        |   |  |               |  \      p
 *    /    |                        |   |  |               |   \     e
 *   +-----+------------------------+---+--+---------------+----+    e
 *   |               BLOCK 1            |      BLOCK 2          |    d
 *
 *                           time ----->
 *
 *  The trapezoid is the shape the speed curve over time. It starts at block->initial_rate, accelerates
 *  first block->accelerate_until step_events_completed, then keeps going at constant speed until
 *  step_events_completed reaches block->decelerate_after after which it decelerates until the trapezoid generator is reset.
 *  The slope of acceleration is calculated using v = u + at where t is the accumulated timer values of the steps so far.
 */
void Stepper::wake_up() {
	//  TCNT1 = 0;
	ENABLE_STEPPER_DRIVER_INTERRUPT();
}

/**
 * Set the stepper direction of each axis
 *
 *   COREXY: X_AXIS=A_AXIS and Y_AXIS=B_AXIS
 *   COREXZ: X_AXIS=A_AXIS and Z_AXIS=C_AXIS
 *   COREYZ: Y_AXIS=B_AXIS and Z_AXIS=C_AXIS
 */
void Stepper::set_directions() {

#define SET_STEP_DIR(AXIS) \
    if (motor_direction(AXIS ##_AXIS)) { \
      AXIS ##_APPLY_DIR(INVERT_## AXIS ##_DIR, false); \
      count_direction[AXIS ##_AXIS] = -1; \
    } \
    else { \
      AXIS ##_APPLY_DIR(!INVERT_## AXIS ##_DIR, false); \
      count_direction[AXIS ##_AXIS] = 1; \
    }

	SET_STEP_DIR(X); // A
	SET_STEP_DIR(Y); // B
	SET_STEP_DIR(Z); // C

#if DISABLED(ADVANCE)
	if ( motor_direction(E_AXIS) ) {
		REV_E_DIR();
		count_direction[E_AXIS] = -1;
	}
	else {
		NORM_E_DIR();
		count_direction[E_AXIS] = 1;
	}
#endif //!ADVANCE
}

// "The Stepper Driver Interrupt" - This timer interrupt is the workhorse.
// It pops blocks from the block_buffer and executes them by pulsing the stepper pins appropriately.
void TIM2_IRQHandler() {
	HAL_TIM_IRQHandler(&TimerStepper);
	stepper.isr();
}

void Stepper::isr() {
	if ( cleaning_buffer_counter ) {
		current_block = NULL;
		planner.discard_current_block();
#ifdef SD_FINISHED_RELEASECOMMAND
		if ((cleaning_buffer_counter == 1) && (SD_FINISHED_STEPPERRELEASE)) enqueue_and_echo_commands_P(PSTR(SD_FINISHED_RELEASECOMMAND));
#endif
		cleaning_buffer_counter--;
		stepperTimerPeriodUpdate(200);

		return;
	}

	// If there is no current block, attempt to pop one from the buffer
	if ( !current_block ) {
		// Anything in the buffer?
		current_block = planner.get_current_block();
		if ( current_block ) {
			current_block->busy = true;
			trapezoid_generator_reset();

			// Initialize Bresenham counters to 1/2 the ceiling
			counter_X = counter_Y = counter_Z = counter_E =
					- ( current_block->step_event_count >> 1 );

#if ENABLED(MIXING_EXTRUDER)
			MIXING_STEPPERS_LOOP(i)
			counter_M[i] = -(current_block->mix_event_count[i] >> 1);
#endif

			step_events_completed = 0;

#if ENABLED(Z_LATE_ENABLE)
			if (current_block->steps[Z_AXIS] > 0) {
				enable_z();
				timer.Init.Period = 2000; //1ms wait
				stepperTimer.Instance->ARR= stepperTimer.Init.Period;
				return;
			}
#endif

			// #if ENABLED(ADVANCE)
			//   e_steps[TOOL_E_INDEX] = 0;
			// #endif
		}
		else {
			stepperTimerPeriodUpdate(2000); //1 khz
		}
	}

	if ( current_block ) {

		// Update endstops state, if enabled
		if ( endstops.enabled
#if HAS_BED_PROBE
		|| endstops.z_probe_enabled
#endif
		)
			endstops.update();

		// Take multiple steps per interrupt (For high speed moves)
		for ( int8_t i = 0; i < step_loops; i++ ) {
#ifndef USBCON
			customizedSerial.checkRx(); // Check for serial chars.
#endif

#if ENABLED(LIN_ADVANCE)
			counter_E += current_block->steps[E_AXIS];
			if (counter_E > 0) {
				counter_E -= current_block->step_event_count;
#if DISABLED(MIXING_EXTRUDER)
				// Don't step E here for mixing extruder
				count_position[E_AXIS] += count_direction[E_AXIS];
				e_steps[TOOL_E_INDEX] += motor_direction(E_AXIS) ? -1 : 1;
#endif
			}

#if ENABLED(MIXING_EXTRUDER)
			// Step mixing steppers proportionally
			long dir = motor_direction(E_AXIS) ? -1 : 1;
			MIXING_STEPPERS_LOOP(j) {
				counter_m[j] += current_block->steps[E_AXIS];
				if (counter_m[j] > 0) {
					counter_m[j] -= current_block->mix_event_count[j];
					e_steps[j] += dir;
				}
			}
#endif

			if (current_block->use_advance_lead) {
				int delta_adv_steps = (((long)extruder_advance_k * current_estep_rate[TOOL_E_INDEX]) >> 9) - current_adv_steps[TOOL_E_INDEX];
#if ENABLED(MIXING_EXTRUDER)
				// Mixing extruders apply advance lead proportionally
				MIXING_STEPPERS_LOOP(j) {
					int steps = delta_adv_steps * current_block->step_event_count / current_block->mix_event_count[j];
					e_steps[j] += steps;
					current_adv_steps[j] += steps;
				}
#else
				// For most extruders, advance the single E stepper
				e_steps[TOOL_E_INDEX] += delta_adv_steps;
				current_adv_steps[TOOL_E_INDEX] += delta_adv_steps;
#endif
			}

#elif ENABLED(ADVANCE)

			// Always count the unified E axis
			counter_E += current_block->steps[E_AXIS];
			if (counter_E > 0) {
				counter_E -= current_block->step_event_count;
#if DISABLED(MIXING_EXTRUDER)
				// Don't step E here for mixing extruder
				e_steps[TOOL_E_INDEX] += motor_direction(E_AXIS) ? -1 : 1;
#endif
			}

#if ENABLED(MIXING_EXTRUDER)

			// Step mixing steppers proportionally
			long dir = motor_direction(E_AXIS) ? -1 : 1;
			MIXING_STEPPERS_LOOP(j) {
				counter_m[j] += current_block->steps[E_AXIS];
				if (counter_m[j] > 0) {
					counter_m[j] -= current_block->mix_event_count[j];
					e_steps[j] += dir;
				}
			}

#endif // MIXING_EXTRUDER

#endif // ADVANCE or LIN_ADVANCE

#define _COUNTER(AXIS) counter_## AXIS
#define _APPLY_STEP(AXIS) AXIS ##_APPLY_STEP
#define _INVERT_STEP_PIN(AXIS) INVERT_## AXIS ##_STEP_PIN

#define STEP_ADD(AXIS) \
        _COUNTER(AXIS) += current_block->steps[_AXIS(AXIS)]; \
        if (_COUNTER(AXIS) > 0) { _APPLY_STEP(AXIS)(!_INVERT_STEP_PIN(AXIS),0); }

			STEP_ADD(X);
			STEP_ADD(Y);
			STEP_ADD(Z);
			/*TODO delay */
			/*2us delay from 4MHz Timer for drv8825 */
uint32_t usTick = getTimerValue(&Timer_usDelay);
#if DISABLED(ADVANCE) && DISABLED(LIN_ADVANCE)
#if ENABLED(MIXING_EXTRUDER)
			// Keep updating the single E axis
			counter_E += current_block->steps[E_AXIS];
			// Tick the counters used for this mix
			MIXING_STEPPERS_LOOP(j) {
				// Step mixing steppers (proportionally)
				counter_M[j] += current_block->steps[E_AXIS];
				// Step when the counter goes over zero
				if (counter_M[j] > 0) En_STEP_WRITE(j, !INVERT_E_STEP_PIN);
			}
#else // !MIXING_EXTRUDER
			STEP_ADD(E);
#endif
#endif // !ADVANCE && !LIN_ADVANCE

#define STEP_IF_COUNTER(AXIS) \
        if (_COUNTER(AXIS) > 0) { \
          _COUNTER(AXIS) -= current_block->step_event_count; \
          count_position[_AXIS(AXIS)] += count_direction[_AXIS(AXIS)]; \
          _APPLY_STEP(AXIS)(_INVERT_STEP_PIN(AXIS),0); \
        }
while (getTimerValue(&Timer_usDelay) - usTick < DIRPulseDelay);
			STEP_IF_COUNTER(X);
			STEP_IF_COUNTER(Y);
			STEP_IF_COUNTER(Z);

