Rejdok/STM32-Marlin-Port/Marlin/Portable/stm32_stepper.cpp
#if DISABLED(ADVANCE) && DISABLED(LIN_ADVANCE)
#if ENABLED(MIXING_EXTRUDER)
			// Always step the single E axis
			if (counter_E > 0) {
				counter_E -= current_block->step_event_count;
				count_position[E_AXIS] += count_direction[E_AXIS];
			}
			MIXING_STEPPERS_LOOP(j) {
				if (counter_M[j] > 0) {
					counter_M[j] -= current_block->mix_event_count[j];
					En_STEP_WRITE(j, INVERT_E_STEP_PIN);
				}
			}
#else // !MIXING_EXTRUDER
			STEP_IF_COUNTER(E);
#endif
#endif // !ADVANCE && !LIN_ADVANCE

			step_events_completed++;
			if ( step_events_completed >= current_block->step_event_count )
				break;
		}

#if ENABLED(ADVANCE) || ENABLED(LIN_ADVANCE)
		// If we have esteps to execute, fire the next ISR "now"
		if (e_steps[TOOL_E_INDEX]) OCR0A = TCNT0 + 2;
#endif

		// Calculate new timer value
		unsigned short timer, step_rate;
		if ( step_events_completed
				<= (unsigned long) current_block->accelerate_until ) {

			MultiU24X32toH16(acc_step_rate, acceleration_time,
					current_block->acceleration_rate);
			acc_step_rate += current_block->initial_rate;

			// upper limit
			NOMORE(acc_step_rate, current_block->nominal_rate);

			// step_rate to timer interval
			timer = calc_timer(acc_step_rate);
			stepperTimerPeriodUpdate(timer);
			acceleration_time += timer;

#if ENABLED(LIN_ADVANCE)

			if (current_block->use_advance_lead)
			current_estep_rate[TOOL_E_INDEX] = ((unsigned long)acc_step_rate * current_block->e_speed_multiplier8) >> 8;

			if (current_block->use_advance_lead) {
#if ENABLED(MIXING_EXTRUDER)
				MIXING_STEPPERS_LOOP(j)
				current_estep_rate[j] = ((unsigned long)acc_step_rate * current_block->e_speed_multiplier8 * current_block->step_event_count / current_block->mix_event_count[j]) >> 8;
#else
				current_estep_rate[TOOL_E_INDEX] = ((unsigned long)acc_step_rate * current_block->e_speed_multiplier8) >> 8;
#endif
			}

#elif ENABLED(ADVANCE)

			advance += advance_rate * step_loops;
			//NOLESS(advance, current_block->advance);

			long advance_whole = advance >> 8,
			advance_factor = advance_whole - old_advance;

			// Do E steps + advance steps
#if ENABLED(MIXING_EXTRUDER)
			// ...for mixing steppers proportionally
			MIXING_STEPPERS_LOOP(j)
			e_steps[j] += advance_factor * current_block->step_event_count / current_block->mix_event_count[j];
#else
			// ...for the active extruder
			e_steps[TOOL_E_INDEX] += advance_factor;
#endif

			old_advance = advance_whole;

#endif // ADVANCE or LIN_ADVANCE

#if ENABLED(ADVANCE) || ENABLED(LIN_ADVANCE)
			eISR_Rate = (timer >> 2) * step_loops / abs(e_steps[TOOL_E_INDEX]);
#endif
		}
		else if ( step_events_completed
				> (unsigned long) current_block->decelerate_after ) {
			MultiU24X32toH16(step_rate, deceleration_time,
					current_block->acceleration_rate);

			if ( step_rate <= acc_step_rate ) { // Still decelerating?
				step_rate = acc_step_rate - step_rate;
				NOLESS(step_rate, current_block->final_rate);
			}
			else
				step_rate = current_block->final_rate;

			// step_rate to timer interval
			timer = calc_timer(step_rate);
			stepperTimerPeriodUpdate(timer);
			deceleration_time += timer;

#if ENABLED(LIN_ADVANCE)

			if (current_block->use_advance_lead) {
#if ENABLED(MIXING_EXTRUDER)
				MIXING_STEPPERS_LOOP(j)
				current_estep_rate[j] = ((unsigned long)step_rate * current_block->e_speed_multiplier8 * current_block->step_event_count / current_block->mix_event_count[j]) >> 8;
#else
				current_estep_rate[TOOL_E_INDEX] = ((unsigned long)step_rate * current_block->e_speed_multiplier8) >> 8;
#endif
			}

#elif ENABLED(ADVANCE)

			advance -= advance_rate * step_loops;
			NOLESS(advance, final_advance);

			// Do E steps + advance steps
			long advance_whole = advance >> 8,
			advance_factor = advance_whole - old_advance;

#if ENABLED(MIXING_EXTRUDER)
			MIXING_STEPPERS_LOOP(j)
			e_steps[j] += advance_factor * current_block->step_event_count / current_block->mix_event_count[j];
#else
			e_steps[TOOL_E_INDEX] += advance_factor;
#endif

			old_advance = advance_whole;

#endif // ADVANCE or LIN_ADVANCE

#if ENABLED(ADVANCE) || ENABLED(LIN_ADVANCE)
			eISR_Rate = (timer >> 2) * step_loops / abs(e_steps[TOOL_E_INDEX]);
#endif
		}
		else {

#if ENABLED(LIN_ADVANCE)

			if (current_block->use_advance_lead)
			current_estep_rate[TOOL_E_INDEX] = final_estep_rate;

			eISR_Rate = (stepperTimerNominal >> 2) * step_loops_nominal / abs(e_steps[TOOL_E_INDEX]);

#endif

			stepperTimerPeriodUpdate(stepperTimerPeriodNominal);
			// ensure we're running at the correct step rate, even if we just came off an acceleration
			step_loops = step_loops_nominal;
		}

		stepperTimerPeriodUpdate(
				( TimerStepper.Init.Period < ( TimerStepper.Instance->CNT + 16 ) ?
						( TimerStepper.Instance->CNT + 16 ) : TimerStepper.Init.Period ));
		// If current block is finished, reset pointer
		if ( step_events_completed >= current_block->step_event_count ) {
			current_block = NULL;
			planner.discard_current_block();
		}
	}
}

#if ENABLED(ADVANCE) || ENABLED(LIN_ADVANCE)

// Timer interrupt for E. e_steps is set in the main routine;
// Timer 0 is shared with millies
ISR(TIMER0_COMPA_vect) {Stepper::advance_isr();}

void Stepper::advance_isr() {

	old_OCR0A += eISR_Rate;
	OCR0A = old_OCR0A;

#define STEP_E_ONCE(INDEX) \
      if (e_steps[INDEX] != 0) { \
        E## INDEX ##_STEP_WRITE(INVERT_E_STEP_PIN); \
        if (e_steps[INDEX] < 0) { \
          E## INDEX ##_DIR_WRITE(INVERT_E## INDEX ##_DIR); \
          e_steps[INDEX]++; \
        } \
        else { \
          E## INDEX ##_DIR_WRITE(!INVERT_E## INDEX ##_DIR); \
          e_steps[INDEX]--; \
        } \
        E## INDEX ##_STEP_WRITE(!INVERT_E_STEP_PIN); \
      }

	// Step all E steppers that have steps
	for (uint8_t i = 0; i < step_loops; i++) {
		STEP_E_ONCE(0);
#if E_STEPPERS > 1
		STEP_E_ONCE(1);
#if E_STEPPERS > 2
		STEP_E_ONCE(2);
#if E_STEPPERS > 3
		STEP_E_ONCE(3);
#endif
#endif
#endif
	}

}

#endif // ADVANCE or LIN_ADVANCE
void Error_Handler() {

	while(1);
}
void Stepper::init() {

	digipot_init(); //Initialize Digipot Motor Current
	microstep_init(); //Initialize Microstepping Pins

	// initialise TMC Steppers
#if ENABLED(HAVE_TMCDRIVER)
	tmc_init();
#endif
	// initialise L6470 Steppers
#if ENABLED(HAVE_L6470DRIVER)
	L6470_init();
#endif

	// Initialize Dir Pins
#if HAS_X_DIR
	X_DIR_INIT;
#endif
#if HAS_X2_DIR
	X2_DIR_INIT;
#endif
#if HAS_Y_DIR
	Y_DIR_INIT;
#if ENABLED(Y_DUAL_STEPPER_DRIVERS) && HAS_Y2_DIR
	Y2_DIR_INIT;
#endif
#endif
#if HAS_Z_DIR
	Z_DIR_INIT;
#if ENABLED(Z_DUAL_STEPPER_DRIVERS) && HAS_Z2_DIR
	Z2_DIR_INIT;
#endif
#endif
#if HAS_E0_DIR
	E0_DIR_INIT;
#endif
#if HAS_E1_DIR
	E1_DIR_INIT;
#endif
#if HAS_E2_DIR
	E2_DIR_INIT;
#endif
#if HAS_E3_DIR
	E3_DIR_INIT;
#endif

	//Initialize Enable Pins - steppers default to disabled.

#if HAS_X_ENABLE
	X_ENABLE_INIT;
	if ( !X_ENABLE_ON )
		X_ENABLE_WRITE(HIGH);
#if ENABLED(DUAL_X_CARRIAGE) && HAS_X2_ENABLE
	X2_ENABLE_INIT;
	if (!X_ENABLE_ON) X2_ENABLE_WRITE(HIGH);
#endif
#endif

#if HAS_Y_ENABLE
	Y_ENABLE_INIT;
	if ( !Y_ENABLE_ON )
		Y_ENABLE_WRITE(HIGH);
#if ENABLED(Y_DUAL_STEPPER_DRIVERS) && HAS_Y2_ENABLE
	Y2_ENABLE_INIT;
	if (!Y_ENABLE_ON) Y2_ENABLE_WRITE(HIGH);
#endif
#endif

#if HAS_Z_ENABLE
	Z_ENABLE_INIT;
	if ( !Z_ENABLE_ON )
		Z_ENABLE_WRITE(HIGH);
#if ENABLED(Z_DUAL_STEPPER_DRIVERS) && HAS_Z2_ENABLE
	Z2_ENABLE_INIT;
	if ( !Z_ENABLE_ON )
		Z2_ENABLE_WRITE(HIGH);
#endif
#endif

#if HAS_E0_ENABLE
	E0_ENABLE_INIT;
	if ( !E_ENABLE_ON )
		E0_ENABLE_WRITE(HIGH);
#endif
#if HAS_E1_ENABLE
	E1_ENABLE_INIT;
	if ( !E_ENABLE_ON )
		E1_ENABLE_WRITE(HIGH);
#endif
#if HAS_E2_ENABLE
	E2_ENABLE_INIT;
	if (!E_ENABLE_ON) E2_ENABLE_WRITE(HIGH);
#endif
#if HAS_E3_ENABLE
	E3_ENABLE_INIT;
	if (!E_ENABLE_ON) E3_ENABLE_WRITE(HIGH);
#endif

	//
	// Init endstops and pullups here
	//
	endstops.init();

#define _STEP_INIT(AXIS) AXIS ##_STEP_INIT
#define _WRITE_STEP(AXIS, HIGHLOW) AXIS ##_STEP_WRITE(HIGHLOW)
#define _DISABLE(axis) disable_## axis()

#define AXIS_INIT(axis, AXIS, PIN) \
    _STEP_INIT(AXIS); \
    _WRITE_STEP(AXIS, _INVERT_STEP_PIN(PIN)); \
    _DISABLE(axis)

