Rejdok/STM32-Marlin-Port/Marlin/Portable/stm32_stepper.cpp
#define E_AXIS_INIT(NUM) AXIS_INIT(e## NUM, E## NUM, E)

	// Initialize Step Pins
#if HAS_X_STEP
#if ENABLED(X_DUAL_STEPPER_DRIVERS) || ENABLED(DUAL_X_CARRIAGE)
	X2_STEP_INIT;
	X2_STEP_WRITE(INVERT_X_STEP_PIN);
#endif
	AXIS_INIT(x, X, X);
#endif

#if HAS_Y_STEP
#if ENABLED(Y_DUAL_STEPPER_DRIVERS)
	Y2_STEP_INIT;
	Y2_STEP_WRITE(INVERT_Y_STEP_PIN);
#endif
	AXIS_INIT(y, Y, Y);
#endif

#if HAS_Z_STEP
#if ENABLED(Z_DUAL_STEPPER_DRIVERS)
	Z2_STEP_INIT;
	Z2_STEP_WRITE(INVERT_Z_STEP_PIN);
#endif
	AXIS_INIT(z, Z, Z);
#endif

#if HAS_E0_STEP
	E_AXIS_INIT(0);
#endif
#if HAS_E1_STEP
	E_AXIS_INIT(1);
#endif
#if HAS_E2_STEP
	E_AXIS_INIT(2);
#endif
#if HAS_E3_STEP
	E_AXIS_INIT(3);
#endif

	/*TODO here been initialization of timers before*/


	ENABLE_STEPPER_DRIVER_INTERRUPT();

#if ENABLED(ADVANCE) || ENABLED(LIN_ADVANCE)

	for (int i = 0; i < E_STEPPERS; i++) {
		e_steps[i] = 0;
#if ENABLED(LIN_ADVANCE)
		current_adv_steps[i] = 0;
#endif
	}

#if defined(TCCR0A) && defined(WGM01)
	CBI(TCCR0A, WGM01);
	CBI(TCCR0A, WGM00);
#endif
	SBI(TIMSK0, OCIE0A);

#endif // ADVANCE or LIN_ADVANCE

	endstops.enable(true); // Start with endstops active. After homing they can be disabled

	set_directions(); // Init directions to last_direction_bits = 0
}

/**
 * Block until all buffered steps are executed
 */
void Stepper::synchronize() {
	while ( planner.blocks_queued() )
		idle();
}

/**
 * Set the stepper positions directly in steps
 *
 * The input is based on the typical per-axis XYZ steps.
 * For CORE machines XYZ needs to be translated to ABC.
 *
 * This allows get_axis_position_mm to correctly
 * derive the current XYZ position later on.
 */
void Stepper::set_position(const long& x, const long& y, const long& z,
		const long& e) {
	CRITICAL_SECTION_START;

#if ENABLED(COREXY)
	// corexy positioning
	// these equations follow the form of the dA and dB equations on http://www.corexy.com/theory.html
	count_position[A_AXIS] = x + y;
	count_position[B_AXIS] = x - y;
	count_position[Z_AXIS] = z;
#elif ENABLED(COREXZ)
	// corexz planning
	count_position[A_AXIS] = x + z;
	count_position[Y_AXIS] = y;
	count_position[C_AXIS] = x - z;
#elif ENABLED(COREYZ)
	// coreyz planning
	count_position[X_AXIS] = x;
	count_position[B_AXIS] = y + z;
	count_position[C_AXIS] = y - z;
#else
	// default non-h-bot planning
	count_position[X_AXIS] = x;
	count_position[Y_AXIS] = y;
	count_position[Z_AXIS] = z;
#endif

	count_position[E_AXIS] = e;
	CRITICAL_SECTION_END;
}

void Stepper::set_e_position(const long& e) {
	CRITICAL_SECTION_START;
	count_position[E_AXIS] = e;
	CRITICAL_SECTION_END;
}

/**
 * Get a stepper's position in steps.
 */
long Stepper::position(AxisEnum axis) {
	CRITICAL_SECTION_START;
	long count_pos = count_position[axis];
	CRITICAL_SECTION_END;
	return count_pos;
}

/**
 * Get an axis position according to stepper position(s)
 * For CORE machines apply translation from ABC to XYZ.
 */
float Stepper::get_axis_position_mm(AxisEnum axis) {
	float axis_steps;
#if ENABLED(COREXY) || ENABLED(COREXZ) || ENABLED(COREYZ)
	// Requesting one of the "core" axes?
	if (axis == CORE_AXIS_1 || axis == CORE_AXIS_2) {
		CRITICAL_SECTION_START;
		long pos1 = count_position[CORE_AXIS_1],
		pos2 = count_position[CORE_AXIS_2];
		CRITICAL_SECTION_END;
		// ((a1+a2)+(a1-a2))/2 -> (a1+a2+a1-a2)/2 -> (a1+a1)/2 -> a1
		// ((a1+a2)-(a1-a2))/2 -> (a1+a2-a1+a2)/2 -> (a2+a2)/2 -> a2
		axis_steps = (pos1 + ((axis == CORE_AXIS_1) ? pos2 : -pos2)) * 0.5f;
	}
	else
	axis_steps = position(axis);
#else
	axis_steps = position(axis);
#endif
	return axis_steps * planner.steps_to_mm[axis];
}

void Stepper::finish_and_disable() {
	synchronize();
	disable_all_steppers();
}

void Stepper::quick_stop() {
	cleaning_buffer_counter = 5000;
	DISABLE_STEPPER_DRIVER_INTERRUPT();
	while ( planner.blocks_queued() )
		planner.discard_current_block();
	current_block = NULL;
	ENABLE_STEPPER_DRIVER_INTERRUPT();
}

void Stepper::endstop_triggered(AxisEnum axis) {

#if ENABLED(COREXY) || ENABLED(COREXZ) || ENABLED(COREYZ)

	float axis_pos = count_position[axis];
	if (axis == CORE_AXIS_1)
	axis_pos = (axis_pos + count_position[CORE_AXIS_2]) * 0.5;
	else if (axis == CORE_AXIS_2)
	axis_pos = (count_position[CORE_AXIS_1] - axis_pos) * 0.5;
	endstops_trigsteps[axis] = axis_pos;

#else // !COREXY && !COREXZ && !COREYZ

	endstops_trigsteps[axis] = count_position[axis];

#endif // !COREXY && !COREXZ && !COREYZ

	kill_current_block();
}

void Stepper::report_positions() {
	CRITICAL_SECTION_START;
	long xpos = count_position[X_AXIS], ypos = count_position[Y_AXIS], zpos =
			count_position[Z_AXIS];
	CRITICAL_SECTION_END;

#if ENABLED(COREXY) || ENABLED(COREXZ)
	SERIAL_PROTOCOLPGM(MSG_COUNT_A);
#else
	SERIAL_PROTOCOLPGM(MSG_COUNT_X);
#endif
	SERIAL_PROTOCOL(xpos);

#if ENABLED(COREXY) || ENABLED(COREYZ)
	SERIAL_PROTOCOLPGM(" B:");
#else
	SERIAL_PROTOCOLPGM(" Y:");
#endif
	SERIAL_PROTOCOL(ypos);

#if ENABLED(COREXZ) || ENABLED(COREYZ)
	SERIAL_PROTOCOLPGM(" C:");
#else
	SERIAL_PROTOCOLPGM(" Z:");
#endif
	SERIAL_PROTOCOL(zpos);

	SERIAL_EOL;
}

#if ENABLED(BABYSTEPPING)

// MUST ONLY BE CALLED BY AN ISR,
// No other ISR should ever interrupt this!
void Stepper::babystep(const uint8_t axis, const bool direction) {

#define _ENABLE(axis) enable_## axis()
#define _READ_DIR(AXIS) AXIS ##_DIR_READ
#define _INVERT_DIR(AXIS) INVERT_## AXIS ##_DIR
#define _APPLY_DIR(AXIS, INVERT) AXIS ##_APPLY_DIR(INVERT, true)

#define BABYSTEP_AXIS(axis, AXIS, INVERT) { \
        _ENABLE(axis); \
        uint8_t old_pin = _READ_DIR(AXIS); \
        _APPLY_DIR(AXIS, _INVERT_DIR(AXIS)^direction^INVERT); \
        _APPLY_STEP(AXIS)(!_INVERT_STEP_PIN(AXIS), true); \
        delayMicroseconds(2); \
        _APPLY_STEP(AXIS)(_INVERT_STEP_PIN(AXIS), true); \
        _APPLY_DIR(AXIS, old_pin); \
      }

	switch (axis) {

		case X_AXIS:
		BABYSTEP_AXIS(x, X, false);
		break;

		case Y_AXIS:
		BABYSTEP_AXIS(y, Y, false);
		break;

		case Z_AXIS: {

#if DISABLED(DELTA)

			BABYSTEP_AXIS(z, Z, BABYSTEP_INVERT_Z);

#else // DELTA

