Rejdok/STM32-Marlin-Port/Marlin/Portable/stm32_stepper.cpp
			bool z_direction = direction ^ BABYSTEP_INVERT_Z;

			enable_x();
			enable_y();
			enable_z();
			uint8_t old_x_dir_pin = X_DIR_READ,
			old_y_dir_pin = Y_DIR_READ,
			old_z_dir_pin = Z_DIR_READ;
			//setup new step
			X_DIR_WRITE(INVERT_X_DIR ^ z_direction);
			Y_DIR_WRITE(INVERT_Y_DIR ^ z_direction);
			Z_DIR_WRITE(INVERT_Z_DIR ^ z_direction);
			//perform step
			X_STEP_WRITE(!INVERT_X_STEP_PIN);
			Y_STEP_WRITE(!INVERT_Y_STEP_PIN);
			Z_STEP_WRITE(!INVERT_Z_STEP_PIN);
			delayMicroseconds(2);
			X_STEP_WRITE(INVERT_X_STEP_PIN);
			Y_STEP_WRITE(INVERT_Y_STEP_PIN);
			Z_STEP_WRITE(INVERT_Z_STEP_PIN);
			//get old pin state back.
			X_DIR_WRITE(old_x_dir_pin);
			Y_DIR_WRITE(old_y_dir_pin);
			Z_DIR_WRITE(old_z_dir_pin);

#endif

		}break;

		default: break;
	}
}

#endif //BABYSTEPPING

/**
 * Software-controlled Stepper Motor Current
 */

#if HAS_DIGIPOTSS

// From Arduino DigitalPotControl example
void Stepper::digitalPotWrite(int address, int value) {
	digitalWrite(DIGIPOTSS_PIN, LOW); // take the SS pin low to select the chip
	SPI.transfer(address);//  send in the address and value via SPI:
	SPI.transfer(value);
	digitalWrite(DIGIPOTSS_PIN, HIGH);// take the SS pin high to de-select the chip:
	//delay(10);
}

#endif //HAS_DIGIPOTSS

void Stepper::digipot_init() {
#if HAS_DIGIPOTSS
	const uint8_t digipot_motor_current[] = DIGIPOT_MOTOR_CURRENT;

	SPI.begin();
	pinMode(DIGIPOTSS_PIN, OUTPUT);
	for (uint8_t i = 0; i < COUNT(digipot_motor_current); i++) {
		//digitalPotWrite(digipot_ch[i], digipot_motor_current[i]);
		digipot_current(i, digipot_motor_current[i]);
	}
#endif
#if HAS_MOTOR_CURRENT_PWM
#if PIN_EXISTS(MOTOR_CURRENT_PWM_XY)
	pinMode(MOTOR_CURRENT_PWM_XY_PIN, OUTPUT);
	digipot_current(0, motor_current_setting[0]);
#endif
#if PIN_EXISTS(MOTOR_CURRENT_PWM_Z)
	pinMode(MOTOR_CURRENT_PWM_Z_PIN, OUTPUT);
	digipot_current(1, motor_current_setting[1]);
#endif
#if PIN_EXISTS(MOTOR_CURRENT_PWM_E)
	pinMode(MOTOR_CURRENT_PWM_E_PIN, OUTPUT);
	digipot_current(2, motor_current_setting[2]);
#endif
	//Set timer5 to 31khz so the PWM of the motor power is as constant as possible. (removes a buzzing noise)
	TCCR5B = (TCCR5B & ~(_BV(CS50) | _BV(CS51) | _BV(CS52))) | _BV(CS50);
#endif
}

void Stepper::digipot_current(uint8_t driver, int current) {
#if HAS_DIGIPOTSS
	const uint8_t digipot_ch[] = DIGIPOT_CHANNELS;
	digitalPotWrite(digipot_ch[driver], current);
#elif HAS_MOTOR_CURRENT_PWM
#define _WRITE_CURRENT_PWM(P) analogWrite(P, 255L * current / (MOTOR_CURRENT_PWM_RANGE))
	switch (driver) {
#if PIN_EXISTS(MOTOR_CURRENT_PWM_XY)
		case 0: _WRITE_CURRENT_PWM(MOTOR_CURRENT_PWM_XY_PIN); break;
#endif
#if PIN_EXISTS(MOTOR_CURRENT_PWM_Z)
		case 1: _WRITE_CURRENT_PWM(MOTOR_CURRENT_PWM_Z_PIN); break;
#endif
#if PIN_EXISTS(MOTOR_CURRENT_PWM_E)
		case 2: _WRITE_CURRENT_PWM(MOTOR_CURRENT_PWM_E_PIN); break;
#endif
	}
#else
	UNUSED(driver);
	UNUSED(current);
#endif
}

void Stepper::microstep_init() {
#if HAS_MICROSTEPS_E1
	pinMode(E1_MS1_PIN, OUTPUT);
	pinMode(E1_MS2_PIN, OUTPUT);
#endif

#if HAS_MICROSTEPS
	pinMode(X_MS1_PIN, OUTPUT);
	pinMode(X_MS2_PIN, OUTPUT);
	pinMode(Y_MS1_PIN, OUTPUT);
	pinMode(Y_MS2_PIN, OUTPUT);
	pinMode(Z_MS1_PIN, OUTPUT);
	pinMode(Z_MS2_PIN, OUTPUT);
	pinMode(E0_MS1_PIN, OUTPUT);
	pinMode(E0_MS2_PIN, OUTPUT);
	const uint8_t microstep_modes[] = MICROSTEP_MODES;
	for (uint16_t i = 0; i < COUNT(microstep_modes); i++)
	microstep_mode(i, microstep_modes[i]);
#endif
}

/**
 * Software-controlled Microstepping
 */

void Stepper::microstep_ms(uint8_t driver, int8_t ms1, int8_t ms2) {
	if ( ms1 >= 0 )
		switch (driver) {
			case 0:
				digitalWrite(X_MS1_PIN, ms1);
				break;
			case 1:
				digitalWrite(Y_MS1_PIN, ms1);
				break;
			case 2:
				digitalWrite(Z_MS1_PIN, ms1);
				break;
			case 3:
				digitalWrite(E0_MS1_PIN, ms1);
				break;
#if HAS_MICROSTEPS_E1
				case 4: digitalWrite(E1_MS1_PIN, ms1); break;
#endif
		}
	if ( ms2 >= 0 )
		switch (driver) {
			case 0:
				digitalWrite(X_MS2_PIN, ms2);
				break;
			case 1:
				digitalWrite(Y_MS2_PIN, ms2);
				break;
			case 2:
				digitalWrite(Z_MS2_PIN, ms2);
				break;
			case 3:
				digitalWrite(E0_MS2_PIN, ms2);
				break;
#if PIN_EXISTS(E1_MS2)
				case 4: digitalWrite(E1_MS2_PIN, ms2); break;
#endif
		}
}

void Stepper::microstep_mode(uint8_t driver, uint8_t stepping_mode) {
	switch (stepping_mode) {
		case 1:
			microstep_ms(driver, MICROSTEP1);
			break;
		case 2:
			microstep_ms(driver, MICROSTEP2);
			break;
		case 4:
			microstep_ms(driver, MICROSTEP4);
			break;
		case 8:
			microstep_ms(driver, MICROSTEP8);
			break;
		case 16:
			microstep_ms(driver, MICROSTEP16);
			break;
	}
}

void Stepper::microstep_readings() {
	SERIAL_PROTOCOLLNPGM("MS1,MS2 Pins");
	SERIAL_PROTOCOLPGM("X: ");
	SERIAL_PROTOCOL(digitalRead(X_MS1_PIN));
	SERIAL_PROTOCOLLN(digitalRead(X_MS2_PIN));
	SERIAL_PROTOCOLPGM("Y: ");
	SERIAL_PROTOCOL(digitalRead(Y_MS1_PIN));
	SERIAL_PROTOCOLLN(digitalRead(Y_MS2_PIN));
	SERIAL_PROTOCOLPGM("Z: ");
	SERIAL_PROTOCOL(digitalRead(Z_MS1_PIN));
	SERIAL_PROTOCOLLN(digitalRead(Z_MS2_PIN));
	SERIAL_PROTOCOLPGM("E0: ");
	SERIAL_PROTOCOL(digitalRead(E0_MS1_PIN));
	SERIAL_PROTOCOLLN(digitalRead(E0_MS2_PIN));
#if HAS_MICROSTEPS_E1
	SERIAL_PROTOCOLPGM("E1: ");
	SERIAL_PROTOCOL(digitalRead(E1_MS1_PIN));
	SERIAL_PROTOCOLLN(digitalRead(E1_MS2_PIN));
#endif
}

#if ENABLED(LIN_ADVANCE)

void Stepper::advance_M905(const float &k) {
	if (k >= 0) extruder_advance_k = k;
	SERIAL_ECHO_START;
	SERIAL_ECHOPAIR("Advance factor: ", extruder_advance_k);
	SERIAL_EOL;
}

#endif // LIN_ADVANCE
